[
    {
      "subRock": "Alternative rock",
      "descRock": "Alternative rock is non-conformist approach to music-making, incorporating elements from various genres and emphasizing creative expression, experimentation, and a DIY ethos."
    },
    {
      "subRock": "Blues rock",
      "descRock": "Blues rock is a mix of blues and rock music. It has soulful vocals, emotive guitar solos, and a driving beat. It's gritty, raw, and passionate, with lyrics about deep emotions. It can be both melancholic and uplifting."
    },
    {
      "subRock": "Electronic rock",
      "descRock": "Electronic rock mixes rock music with electronic sounds and technology. It typically features heavy use of synthesizers, drum machines, and other electronic instruments, often with a driving beat and intense energy. The music can have a futuristic or sci-fi feel, with distorted guitars and vocals blended with electronic elements."
    },
    {
      "subRock": "Experimental rock",
      "descRock": "Experimental rock breaks the rules of traditional rock music. It often challenges listeners' expectations and can be both avant-garde and emotionally expressive. The feel of experimental rock can vary greatly, ranging from cerebral and abstract to raw and visceral, with a sense of artistic freedom and exploration."
    },
    {
      "subRock": "Glam rock",
      "descRock": "Glam rock typically features heavily distorted guitars, prominent use of synthesizers and other electronic instruments, and a strong rhythm section. It places a strong emphasis on image and style, with outrageous costumes, makeup, and hairstyles. The sound is generally high-energy and danceable, with a sense of glamour and escapism."
    },
    {
      "subRock": "Gothic rock",
      "descRock": "6"
    },
    {
      "subRock": "Hard rock",
      "descRock": "7"
    },
    {
      "subRock": "Hardcore punk",
      "descRock": "8"
    },
    {
      "subRock": "Indie rock",
      "descRock": "9"
    },
    {
      "subRock": "Math rock",
      "descRock": "10"
    },
    {
      "subRock": "Melodic rock",
      "descRock": "11"
    },
    {
      "subRock": "Neo-progressive rock",
      "descRock": "12"
    },
    {
      "subRock": "Noise rock",
      "descRock": "13"
    },
    {
      "subRock": "Occult rock",
      "descRock": "14"
    },
    {
      "subRock": "Post-grunge",
      "descRock": "15"
    },
    {
      "subRock": "Post-hardcore",
      "descRock": "16"
    },
    {
      "subRock": "Post-rock",
      "descRock": "17"
    },
    {
      "subRock": "Progressive rock",
      "descRock": "18"
    },
    {
      "subRock": "Psychedelic rock",
      "descRock": "19"
    },
    {
      "subRock": "Shoegaze",
      "descRock": "20"
    },
    {
      "subRock": "Stoner rock",
      "descRock": "21"
    },
    {
      "subRock": "Heavy progressive rock",
      "descRock": "22"
    },
    {
      "subRock": "Crossover progressive rock",
      "descRock": "23"
    }
  ]