[
    {
      "subRock": "Alternative rock",
      "descRock": "Alternative rock is non-conformist approach to music-making, incorporating elements from various genres and emphasizing creative expression, experimentation, and a DIY ethos."
    },
    {
      "subRock": "Blues rock",
      "descRock": "Blues rock is a mix of blues and rock music. It has soulful vocals, emotive guitar solos, and a driving beat. It's gritty, raw, and passionate, with lyrics about deep emotions. It can be both melancholic and uplifting."
    },
    {
      "subRock": "Electronic rock",
      "descRock": "Electronic rock blends rock music with electronic sounds and often uses synthesizers, drum machines, and other electronic instruments. It's high-energy with a driving beat and can have a futuristic or sci-fi feel, combining distorted guitars and vocals with electronic elements."
    },
    {
      "subRock": "Experimental rock",
      "descRock": "Experimental rock defies traditional norms, challenging expectations with avant-garde and emotive expression. It can range from cerebral to raw, showcasing artistic freedom and exploration."
    },
    {
      "subRock": "Glam rock",
      "descRock": "Glam rock has distorted guitars, synthesizers, and a strong rhythm section. It's known for image and style, with outrageous costumes and high-energy, danceable music that exudes glamour and escapism."
    },
    {
      "subRock": "Gothic rock",
      "descRock": "Gothic rock is dark, moody music that explores melancholic and macabre themes, with deep vocals, melodic guitar lines, and eerie synthesizers or keyboards. It creates a brooding atmosphere filled with mystery and drama."
    },
    {
      "subRock": "Hard rock",
      "descRock": "Hard rock is loud, aggressive music with powerful guitar riffs, strong rhythms, and bold vocals. It's energetic, gritty, and focuses on rebellion and life struggles, with anthemic choruses that get your adrenaline pumping."
    },
    {
      "subRock": "Hardcore punk",
      "descRock": "Hardcore punk is a fast and aggressive. It features short, fast-paced songs with distorted guitars, intense drumming, and shouted vocals. Hardcore punk has politically charged lyrics addressing social issues. The music is raw, powerful, and urgent, with an intense and energetic feel."
    },
    {
      "subRock": "Indie rock",
      "descRock": "Indie rock is a genre with a DIY ethos and diverse styles. It's often guitar-driven and introspective with a raw, authentic feel. The sound ranges from acoustic melodies to catchy rock anthems. Indie rock values creativity, individuality, and artistic expression, with a non-conformist, alternative feel."
    },
    {
      "subRock": "Math rock",
      "descRock": "Math rock is a genre with intricate rhythms, unconventional time signatures, and technical musicianship. It features angular melodies, unpredictable structures, and showcases guitar tapping, odd time signatures, and unconventional progressions."
    },
    {
      "subRock": "Melodic rock",
      "descRock": "Melodic rock is upbeat and energetic music that emphasizes melody, harmony, catchy choruses, melodic guitar lines, and powerful vocals. Influenced by classic rock, pop, and other melodic genres, it is positive and uplifting with memorable hooks and polished production."
    },
    {
      "subRock": "Neo-progressive rock",
      "descRock": "Neo-progressive rock is a genre drawing from classic progressive rock, featuring intricate instrumentals, complex time signatures, and thought-provoking lyrics. Incorporating elements of jazz, classical, and symphonic music, it has a polished and technical production style. It's introspective, grandiose, and ambitious, with a focus on storytelling and dramatic crescendos."
    },
    {
      "subRock": "Noise rock",
      "descRock": "Noise rock is a raw, aggressive genre with dissonant sound, unconventional guitar techniques, shouted/screamed vocals, and a focus on chaos and experimentation, pushing traditional rock boundaries."
    },
    {
      "subRock": "Occult rock",
      "descRock": "14"
    },
    {
      "subRock": "Post-grunge",
      "descRock": "15"
    },
    {
      "subRock": "Post-hardcore",
      "descRock": "16"
    },
    {
      "subRock": "Post-rock",
      "descRock": "17"
    },
    {
      "subRock": "Progressive rock",
      "descRock": "18"
    },
    {
      "subRock": "Psychedelic rock",
      "descRock": "19"
    },
    {
      "subRock": "Shoegaze",
      "descRock": "20"
    },
    {
      "subRock": "Stoner rock",
      "descRock": "21"
    },
    {
      "subRock": "Heavy progressive rock",
      "descRock": "22"
    },
    {
      "subRock": "Crossover progressive rock",
      "descRock": "23"
    }
  ]